# Taps
tap "derailed/k9s"
tap "jandedobbeleer/oh-my-posh"

brew "autoconf"
brew "btop"
brew "derailed/k9s/k9s"
brew "dive"
brew "intelli-shell"
brew "opencode"
brew "pinentry-mac"
brew "pre-commit"
brew "qqqa"
brew "rbenv"
brew "rust"
brew "volta"

# Apps
cask "apache-directory-studio" if OS.mac?
cask "atuin-desktop" if OS.mac?
cask "bruno" if OS.mac?
cask "camunda-modeler" if OS.mac?
cask "citrix-workspace" if OS.mac?
cask "confluent-cli" if OS.mac?
cask "dda" if OS.mac?
cask "google-chrome@beta" if OS.mac?
cask "gpg-suite" if OS.mac?
cask "homerow" if OS.mac?
cask "insomnia" if OS.mac?
cask "jprofiler" if OS.mac?
cask "keepassxc" if OS.mac?
cask "keystore-explorer" if OS.mac?
cask "lens" if OS.mac?
cask "logi-options+" if OS.mac?
cask "logitech-g-hub" if OS.mac?
cask "miniconda" if OS.mac?
cask "miro" if OS.mac?
cask "mouseless@preview" if OS.mac?
cask "opcode" if OS.mac?
cask "opencode-desktop" if OS.mac?
cask "openlens" if OS.mac?
cask "oracle-jdk" if OS.mac?
cask "podman-desktop" if OS.mac?
cask "visual-studio-code" if OS.mac?
cask "voiceink" if OS.mac?
cask "wooshy" if OS.mac?
cask "yubico-authenticator" if OS.mac?
