# Taps
tap "CJ-Systems/homebrew-gitflow-cjs"
tap "bramstein/webfonttools"
tap "ggozad/formulas"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "olets/tap"
tap "rsteube/homebrew-tap"
tap "vet-run/vet"

brew "ack"
brew "archey4"
brew "ast-grep"
brew "argocd"
brew "asdf"
brew "atuin"
brew "bash" # Latest Bash version
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "bat-extras" # Bash scripts that integrate bat with various command-line tools
brew "bottom"
brew "broot"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "docker"
brew "docker-completion"
brew "docker-compose"
brew "duf"
brew "dust"
brew "emojify"
brew "eza"
brew "fd" # Simple, fast and user-friendly alternative to find
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "fzf" # Command-line fuzzy finder written in Go
brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-delta"
brew "git-flow-cjs"
brew "git-lfs"
brew "glab"
brew "glances"
brew "gnu-sed" # Install GNU `sed`, overwriting the built-in `sed`.
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go"
brew "grep"
brew "gs"
brew "helm"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jfrog-cli"
brew "jq" # Lightweight and flexible command-line JSON processor
brew "just"
brew "lazydocker"
brew "lazygit"
brew "lsd" # Clone of ls with colorful output, file type icons, and more
brew "mackup" if OS.mac?
brew "mas" if OS.mac? # Mac App Store command-line interface
brew "moreutils" # Install some other useful utilities like `sponge`.
brew "ncdu"
brew "neovim"
brew "nushell"
brew "oh-my-posh"
brew "openssh"
brew "opentofu"
brew "p7zip"
brew "peco"
brew "phantom"
brew "pigz"
brew "pkg-config"
brew "podman"
brew "pv"
brew "rename"
brew "ripgrep"
brew "rlwrap"
brew "rsteube/tap/carapace"
brew "screen"
brew "sheldon" # Fast, configurable, shell plugin manager
brew "shellcheck"
brew "ssh-copy-id"
brew "tmux"
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "trivy"
brew "uv"
brew "vale"
brew "vbindiff"
brew "vet-run"
brew "wget" # Install `wget` with IRI support.
brew "witr"
brew "yabai"
brew "zopfli"
brew "zoxide" # Fast, configurable, shell plugin manager
brew "zsh" # UNIX shell (command interpreter)
brew "zsh-abbr" # Auto-expanding abbreviations manager for zsh, inspired by fish

## Install font tools.
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"

# LSP
brew "bash-language-server"
brew "docker-language-server"
brew "dockerfile-language-server"
brew "jdtls"
brew "kotlin-language-server"
brew "lua-language-server"
brew "postgres-language-server"
brew "sql-language-server"
brew "typescript-language-server"
brew "yaml-language-server"

# Apps
cask "nikitabobko/tap/aerospace" if OS.mac?
cask "arc" if OS.mac?
cask "bartender" if OS.mac?
cask "beyond-compare" if OS.mac?
cask "bitwarden" if OS.mac?
cask "claude-code"
cask "dash" if OS.mac?
cask "deepl" if OS.mac?
cask "finicky" if OS.mac?
cask "fman" if OS.mac?
cask "gcloud-cli" if OS.mac?
cask "ghostty"
cask "git-credential-manager" if OS.mac?
cask "istat-menus" if OS.mac?
cask "jetbrains-toolbox" if OS.mac?
cask "jordanbaird-ice" if OS.mac?
cask "karabiner-elements" if OS.mac?
cask "logi-options+" if OS.mac?
cask "raindropio" if OS.mac?
cask "raycast" if OS.mac?
cask "slack" if OS.mac?
cask "sublime-text" if OS.mac?
cask "uhk-agent" if OS.mac?
cask "visualvm" if OS.mac?
cask "vlc" if OS.mac?
cask "wezterm" if OS.mac?
cask "zen" if OS.mac?

# Fonts
cask "font-fira-code" if OS.mac?
cask "font-fira-code-nerd-font" if OS.mac?
cask "font-fira-mono-nerd-font" if OS.mac?
cask "font-jetbrains-mono-nerd-font" if OS.mac?
cask "font-liberation" if OS.mac?
cask "font-liberation-nerd-font" if OS.mac?
cask "font-noto-nerd-font" if OS.mac?
cask "font-zxgamut" if OS.mac?

# Mac App Store
mas "Racompass", id: 1538380685
mas "Xcode", id: 497799835
