# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'bramstein/webfonttools'
tap 'koekeishiya/formulae'

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# ln -s "${BREW_PREFIX}/bin/gsha256sum" "${BREW_PREFIX}/bin/sha256sum"

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed'
# Latest Bash version
brew 'bash'

# Install `wget` with IRI support.
brew 'wget'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
brew 'openssh'
brew 'screen'

## Install font tools.
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install other useful binaries.
brew 'asdf'
brew 'ack'
brew 'archey4'
brew 'argocd'
brew 'bat'
brew 'bat-extras'
brew 'broot'
brew 'bottom'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'glab'
brew 'gs'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jfrog-cli'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'neovim'
brew 'opentofu'
brew 'p7zip'
brew 'pkg-config'
brew 'pigz'
brew 'pnpm'
brew 'pv'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'ssh-copy-id'
brew 'starship'
brew 'tmux'
brew 'tree'
brew 'vale'
brew 'vbindiff'
brew 'yabai'
brew 'yarn'
brew 'zopfli'
brew 'zoxide'

# Apps
cask 'affinity-designer'
cask 'affinity-photo'
cask 'affinity-publisher'
cask 'arc'
# cask 'apache-directory-studio'
cask 'beyond-compare'
# cask 'camunda-modeler'
# cask 'citrix-workspace'
cask 'cleanmymac'
# cask 'confluent-cli'
cask 'daisydisk'
cask 'dash'
cask 'deepl'
cask 'dropbox'
cask 'fantastical'
cask 'finicky'
cask 'fman'
cask 'git-credential-manager'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'lens'
cask 'istat-menus'
cask 'jetbrains-toolbox'
cask 'jordanbaird-ice'
cask 'jprofiler'
cask 'karabiner-elements'
cask 'kdrive'
# cask 'keystore-explorer'
cask 'lens'
cask 'logi-options-plus'
cask 'logseq'
# cask 'miro'
cask 'raindropio'
cask 'raycast'
cask 'roon'
cask 'slack'
cask 'readdle-spark'
cask 'sublime-text'
cask 'tidal'
cask 'uhk-agent'
cask 'visualvm'
cask 'vlc'
cask 'xld'

# Fonts
cask 'font-roboto'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-liberation'
cask 'font-liberation-nerd-font'

# Mac App Store
mas 'Ampado PRO', id: 1423295407
mas 'Bitwarden', id: 1352778147
mas 'iFinance 5', id: 1500241909
mas 'kChat', id: 6443845553
mas 'LilyView', id: 529490330
mas 'MacFamilyTree 10', id: 1567970985
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Numbers', id: 409203825
mas 'Phiewer PRO', id: 1270923434
mas 'Racompass', id: 1538380685
mas 'Tailscale', id: 1475387142
mas 'Xcode', id: 497799835
