# Taps
tap 'homebrew/bundle'
tap 'bramstein/webfonttools'
tap 'koekeishiya/formulae'
tap 'CJ-Systems/homebrew-gitflow-cjs'
tap 'jandedobbeleer/oh-my-posh'
tap 'homebrew/cask-fonts' if OS.mac?

# Install GNU core utilities (those that come with macOS are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# ln -s "${BREW_PREFIX}/bin/gsha256sum" "${BREW_PREFIX}/bin/sha256sum"

# Install some other useful utilities like `sponge`.
brew 'moreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed'
# Latest Bash version
brew 'bash'

# Install `wget` with IRI support.
brew 'wget'

# Install GnuPG to enable PGP-signing commits.
brew 'gnupg'

# Install more recent versions of some macOS tools.
brew 'vim'
brew 'grep'
brew 'openssh'
brew 'screen'

## Install font tools.
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install other useful binaries.
brew 'asdf'
brew 'ack'
brew 'archey4'
brew 'argocd'
brew 'bat'
brew 'bat-extras'
brew 'broot'
brew 'bottom'
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'duf'
brew 'dust'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-flow-cjs'
brew 'git-lfs'
brew 'glab'
brew 'gs'
brew 'helm'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jfrog-cli'
brew 'jq'
brew 'lazydocker'
brew 'lazygit'
brew 'mas' if OS.mac? # Mac App Store manager
brew 'mackup' if OS.mac?
brew 'ncdu'
brew 'neovim'
brew 'oh-my-posh'
brew 'opentofu'
brew 'p7zip'
brew 'pkg-config'
brew 'pigz'
brew 'pnpm'
brew 'pv'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'ssh-copy-id'
brew 'starship'
brew 'tmux'
brew 'tree'
brew 'vale'
brew 'vbindiff'
brew 'yabai'
brew 'yarn'
brew 'zopfli'
brew 'zoxide'

# Apps
# cask 'affinity-designer' if OS.mac?
# cask 'affinity-photo' if OS.mac?
# cask 'affinity-publisher' if OS.mac?
cask 'arc' if OS.mac?
# cask 'apache-directory-studio'
cask 'beyond-compare' if OS.mac?
# cask 'camunda-modeler' if OS.mac?
# cask 'citrix-workspace' if OS.mac?
# cask 'cleanmymac' if OS.mac?
# cask 'confluent-cli' if OS.mac?
# cask 'daisydisk' if OS.mac?
cask 'dash' if OS.mac?
cask 'deepl' if OS.mac?
# cask 'dropbox' if OS.mac?
# cask 'fantastical' if OS.mac?
cask 'finicky' if OS.mac?
cask 'fman' if OS.mac?
cask 'git-credential-manager' if OS.mac?
# cask 'google-chrome' if OS.mac?
cask 'google-cloud-sdk' if OS.mac?
# cask 'google-drive' if OS.mac?
cask 'istat-menus' if OS.mac?
cask 'jetbrains-toolbox' if OS.mac?
cask 'jordanbaird-ice' if OS.mac?
# cask 'jprofiler' if OS.mac?
cask 'karabiner-elements' if OS.mac?
# cask 'kdrive' if OS.mac?
# cask 'keystore-explorer' if OS.mac?
# cask 'lens' if OS.mac?
cask 'logi-options-plus' if OS.mac?
# cask 'logseq' if OS.mac?
# cask 'miro' if OS.mac?
cask 'raindropio' if OS.mac?
cask 'raycast' if OS.mac?
# cask 'roon' if OS.mac?
cask 'slack' if OS.mac?
# cask 'readdle-spark' if OS.mac?
cask 'sublime-text' if OS.mac?
# cask 'tidal' if OS.mac?
cask 'uhk-agent' if OS.mac?
cask 'visualvm' if OS.mac?
cask 'wezterm' if OS.mac?
cask 'vlc' if OS.mac?
# cask 'xld' if OS.mac?

# Fonts
cask 'font-roboto' if OS.mac?
cask 'font-fira-code' if OS.mac?
cask 'font-fira-code-nerd-font' if OS.mac?
cask 'font-fira-mono-nerd-font' if OS.mac?
cask 'font-jetbrains-mono-nerd-font' if OS.mac?
cask 'font-noto-nerd-font' if OS.mac?
cask 'font-liberation' if OS.mac?
cask 'font-liberation-nerd-font' if OS.mac?

# Mac App Store
mas 'Ampado PRO', id: 1423295407
mas 'Bitwarden', id: 1352778147
mas 'Barbee', id: 1548711022
mas 'iFinance 5', id: 1500241909
mas 'kChat', id: 6443845553
mas 'LilyView', id: 529490330
mas 'MacFamilyTree 10', id: 1567970985
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Numbers', id: 409203825
mas 'Phiewer PRO', id: 1270923434
mas 'Racompass', id: 1538380685
mas 'Tailscale', id: 1475387142
mas 'Xcode', id: 497799835
